<div style="text-align:center;">
    <div class="alert alert-block alert-success">
        <b>Assignment 23: Pandas Advance </b>[24_Feb_2023]
    </div>
</div>

In [1]:
import pandas as pd

# Q1. List any five functions of the pandas library with execution.

###  Here are five common functions of the Pandas library with examples of how to execute them:

### 1. `groupby()` : This function is used to group data by one or more columns and perform an operation such as sum, mean, or count, to each group.

In [2]:
# Create a DataFrame with student grades
data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'Henry'],
        'grade_level': ['freshman', 'sophomore', 'junior', 'senior', 'freshman', 'sophomore', 'junior', 'senior'],
        'grade': [90, 85, 95, 80, 92, 88, 94, 81]}

df = pd.DataFrame(data)
df

      name grade_level  grade
0    Alice    freshman     90
1      Bob   sophomore     85
2  Charlie      junior     95
3    David      senior     80
4    Emily    freshman     92
5    Frank   sophomore     88
6    Grace      junior     94
7    Henry      senior     81

In [3]:
# Group the data by grade level and compute the average grade
# Group data by "category" column and calculate the mean of the "value" column
#grouped_data = df.groupby("category")["value"].mean()
group_by = df.groupby('grade_level')['grade'].mean()
group_by

grade_level
freshman     91.0
junior       94.5
senior       80.5
sophomore    86.5
Name: grade, dtype: float64

### 2. `nunique()` : This is another function of the Pandas library, which returns the number of `unique values` in a DataFrame or a Series.

In [4]:
# Create a DataFrame with some duplicate values
df = pd.DataFrame({
    "A": [1, 2, 2, 3, 3],
    "B": [4, 5, 6, 7, 7]
})

# Count the number of unique values in each column
df.nunique()

A    3
B    4
dtype: int64

### 3. `isnull() and notnull()` : These are two functions of the Pandas library that are used to check for `missing or null values` in a DataFrame or a Series.

- isnull() returns a Boolean mask indicating which values are `missing or null` , whereas notnull() returns a Boolean mask indicating which values are `not missing or null`

In [6]:
# Create a DataFrame with some missing values
df = pd.DataFrame({
    "A": [1, 2, None, 4],
    "B": [5, None, 7, 8]
})

# Use isnull() to check for missing values
missing_values = df.isnull()

# Use notnull() to check for non-missing values
non_missing_values = df.notnull()

# Print the results
print("Missing Values:")
print(missing_values)
print(" \nNon-Missing Values:")
print(non_missing_values)

Missing Values:
       A      B
0  False  False
1  False   True
2   True  False
3  False  False

Non-Missing Values:
       A      B
0   True   True
1   True  False
2  False   True
3   True   True

### 4. `drop(labels)` : This function  is used to remove specified rows or columns from a DataFrame. The labels parameter specifies the labels (i.e., names) of the rows or columns to be removed.

In [7]:
# Create a DataFrame
df = pd.DataFrame({
    "State": ['Uttar_Pradesh', 'Madhya_Pradesh', 'Kerala', 'Bihar', 'Gujarat'],
    "City": ['Lucknow', 'Bhopal', 'Benguluru', 'Patna', 'Ahemdabad'],
    "Email": ['nimish@gmail.com', 'kishan@gmail.com', 'sarvansh@gmail.com', 'nitya@gmail.com', 'akshay']
}, index=['Nimish', 'Kishan', 'Sarvansh', 'Nitya', 'Akshay'])
df

                   State       City               Email
Nimish     Uttar_Pradesh    Lucknow    nimish@gmail.com
Kishan    Madhya_Pradesh     Bhopal    kishan@gmail.com
Sarvansh          Kerala  Benguluru  sarvansh@gmail.com
Nitya              Bihar      Patna     nitya@gmail.com
Akshay           Gujarat  Ahemdabad              akshay

In [8]:
# Drop column "State"
df.drop('State', axis=1)

               City               Email
Nimish      Lucknow    nimish@gmail.com
Kishan       Bhopal    kishan@gmail.com
Sarvansh  Benguluru  sarvansh@gmail.com
Nitya         Patna     nitya@gmail.com
Akshay    Ahemdabad              akshay

In [9]:
# Drop row "Nitya"
df.drop('Nitya', axis=0)

                   State       City               Email
Nimish     Uttar_Pradesh    Lucknow    nimish@gmail.com
Kishan    Madhya_Pradesh     Bhopal    kishan@gmail.com
Sarvansh          Kerala  Benguluru  sarvansh@gmail.com
Akshay           Gujarat  Ahemdabad              akshay

#### In this example, we have created a DataFrame with three columns ("State", "City", and "Email") and five rows ("Nimish", "Kishan", "Sarvansh", "NItya" "Akshay". We then used the drop() function to remove column "State" by specifying axis=1, which indicates that we are dropping a column (as opposed to a row). We also used the drop() function to remove row "Nitya" by specifying axis=0, which indicates that we are dropping a row (as opposed to a column).

### 5. `pivot_table()` : This is used to create a spreadsheet-style pivot table from a given DataFrame. It allows us to summarize and aggregate data by one or more columns, creating a new table that shows the relationship between those columns and some other variable(s).

In [17]:
# Create a DataFrame
df = pd.DataFrame({
    "Year": [2019, 2019, 2019, 2020, 2019, 2020],
    "Month": ["Jan", "Feb", "Mar", "Jan", "Feb", "Mar"],
    "Sales": [100, 200, 300, 150, 250, 350],
    "Expenses": [50, 100, 150, 75, 125, 175]
})

# Create a pivot table to summarize the data by year and month
pivot = df.pivot_table(values = ["Sales", "Expenses"], index = "Year", columns = "Month", aggfunc = "sum")
pivot

      Expenses               Sales
Month      Feb   Jan    Mar    Feb    Jan    Mar
Year
2019     225.0  50.0  150.0  450.0  100.0  300.0
2020       NaN  75.0  175.0    NaN  150.0  350.0

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
# Create a sample DataFrame
df = pd.DataFrame({"A":['a', 'b', 'c', 'd', 'e'],
                   "B":['g', 'h', 'i', 'j', 'k' ],
                   "C":['l', 'm', 'n', 'o','p']
                  })
df

   A  B  C
0  a  g  l
1  b  h  m
2  c  i  n
3  d  j  o
4  e  k  p

In [13]:
# Creating a Python Function to re-index the above dataframe with  new index
def reindex_data_frame(df):
    value = df.reindex(range(1 , len(df)+1 , 2))
    return value

In [14]:
# Re-index the DataFrame df
reindex_data_frame(df)

     A    B    C
1    b    h    m
3    d    j    o
5  NaN  NaN  NaN

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [16]:
# create sample DataFrame
df = pd.DataFrame({"Values":[10, 20, 30, 40, 50]
                  })
# Display the dataFrame
df

   Values
0      10
1      20
2      30
3      40
4      50

In [17]:
# Creating function which will add the first three value of `values` column
def sum_of_three_value (df):
    
    # It will give first three rows of values column
    first_three_value = df.loc[0:2, "Values"]
    
    # adiing all three values using built-in function sum() 
    value = sum(first_three_value)
    return value

In [18]:
sum_of_three_value(df)

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [19]:
df = pd.DataFrame({'Text' : ['Hii my name is Nimish.','I am a Data Science enthusiast.','This is my Pandas assignment.',
                             'Pandas is very powerful library.']})
df

                               Text
0            Hii my name is Nimish.
1   I am a Data Science enthusiast.
2     This is my Pandas assignment.
3  Pandas is very powerful library.

In [21]:
def word_count(df):
    
    df['Word_count'] = [len(i.split()) for i in df.iloc[0: , 0]]
    return df

In [22]:
word_count(df)

                               Text  Word_count
0            Hii my name is Nimish.           5
1   I am a Data Science enthusiast.           6
2     This is my Pandas assignment.           5
3  Pandas is very powerful library.           5

# Q5. How are DataFrame.size() and DataFrame.shape() different?

#### Both DataFrame.size() and DataFrame.shape() are attributes in Pandas library for DataFrames, but they return different information.

#### `DataFrame.size` returns the total number of elements (cells) in the DataFrame, which is equal to the product of the number of rows and columns in the DataFrame. This is equivalent to calling DataFrame.shape[0] * DataFrame.shape[1].

#### `DataFrame.shape` returns a tuple with two elements: the number of rows and the number of columns in the DataFrame.

#### Here's an example that demonstrates the difference between DataFrame.size and DataFrame.shape:

In [39]:
df = pd.DataFrame({
    "A": [1, 2, None, 4],
    "B": [5, None, 7, 8]
})

print(f"DataFrame.shape : {df.shape} 'Four rows and two columns'")
print(f"DataFrame.size : {df.size} 'Four rows * two columns' ")

DataFrame.shape : (4, 2) 'Four rows and two columns'
DataFrame.size : 8 'Four rows * two columns'

# Q6. Which function of pandas do we use to read an excel file?

#### To read an Excel file in Pandas, we can use the `read_excel()` function. This function is part of the Pandas IO tools and can read data from Excel files with various extensions like .xlsx, .xls, and .xlsm.

In [ ]:
# read the excel file into a pandas DataFrame
df = pd.read_excel('File_Name.xlsx', sheet_name='Sheet1')

#### In the above code, File_Name.xlsx is the name of the Excel file you want to read, and Sheet1 is the name of the sheet you want to read (if there are multiple sheets in the file).

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

# The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [83]:
df = pd.DataFrame({'Email':['nimish@gmail.com','akshay@gmail.comin','uppolice@gmail.com',
                            'Ineuron@gmail.com','Mygov@gmail.com']})

df

                Email
0    nimish@gmail.com
1  akshay@gmail.comin
2  uppolice@gmail.com
3   Ineuron@gmail.com
4     Mygov@gmail.com

In [84]:
def username(df):
    
    # create a new column 'Username' by splitting the 'Email' column using '@' symbol
    df['Username'] = df['Email'].str.split('@').str[0]
    return df
    
username(df)

                Email  Username
0    nimish@gmail.com    nimish
1  akshay@gmail.comin    akshay
2  uppolice@gmail.com  uppolice
3   Ineuron@gmail.com   Ineuron
4     Mygov@gmail.com     Mygov

#### In the above code the str.split() method is applied to the 'Email' column of the DataFrame df. The '@' symbol is specified as the delimiter to split the string and the [0] index is used to select the first part of the split, which is the username.

#### str.split() is a method of the Pandas Series object that is used to split a string into a list of substrings based on a specified delimiter.

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

# For example, if df contains the following values:

| |A|B|C|
|-|-|-|-|
|0|3|5|1|
|1|8|2|7|
|2|6|9|4|
|3|2|3|5|
|4|9|1|2|

# Your function should select the following rows: A B C

| |A|B|C|
|-|-|-|-|
|1|8|2|7|
|4|9|1|2|

In [23]:
# Creating the example DataFrame
df = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [24]:
def select_row(df):
    # select rows where 'A' is greater than 5 and 'B' is less than 10
    new_df= df[ (df['A'] > 5)  &  (df['B'] < 10) ]
    return new_df

In [25]:
select_row(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Note : With respect to the given condition the above question will display three rows. But in question it said the function should select only two rows  which is not true according to given condition.

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [17]:
def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std

In [18]:
df = pd.DataFrame({'Values': [10,23,45,53,93]})
df

   Values
0      10
1      23
2      45
3      53
4      93

In [28]:
mean_value, median_value, std_value =  calculate_stats(df)
print("Mean Value = {} \nMedian Value = {} \nStd Value = {}".format(mean_value, median_value, std_value))

Mean Value = 44.8
Median Value = 45.0
Std Value = 31.924911902775865

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [5]:
def moving_average(df):
    average = df['Sales'].rolling(window=7, min_periods=1).mean()
    df['MovingAverage'] = average
    return df

In [6]:
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
             '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12', '2022-01-13', '2022-01-14'],
    'Sales': [14, 24, 36, 11, 42, 74, 32, 51, 97, 97, 95, 111, 34, 55]
})
df

          Date  Sales
0   2022-01-01     14
1   2022-01-02     24
2   2022-01-03     36
3   2022-01-04     11
4   2022-01-05     42
5   2022-01-06     74
6   2022-01-07     32
7   2022-01-08     51
8   2022-01-09     97
9   2022-01-10     97
10  2022-01-11     95
11  2022-01-12    111
12  2022-01-13     34
13  2022-01-14     55

In [7]:
moving_average(df)

          Date  Sales  MovingAverage
0   2022-01-01     14      14.000000
1   2022-01-02     24      19.000000
2   2022-01-03     36      24.666667
3   2022-01-04     11      21.250000
4   2022-01-05     42      25.400000
5   2022-01-06     74      33.500000
6   2022-01-07     32      33.285714
7   2022-01-08     51      38.571429
8   2022-01-09     97      49.000000
9   2022-01-10     97      57.714286
10  2022-01-11     95      69.714286
11  2022-01-12    111      79.571429
12  2022-01-13     34      73.857143
13  2022-01-14     55      77.142857

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

# For example, if df contains the following values:

| |Date|
|-|-|
|0|2023-01-01|
|1|2023-01-02|
|2|2023-01-03|
|3|2023-01-04|
|4|2023-01-05|

# Your function should create the following DataFrame:

| |Date|Weekday|
|-|-|-|
|0|2023-01-01|Sunday|
|1|2023-01-02|Monday|
|2|2023-01-03|Tuesday|
|3|2023-01-04|Wednesday|
|4|2023-01-05|Thursday|

# The function should return the modified DataFrame.

In [2]:
df = pd.DataFrame({'Date':['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
                           '2023-02-10', '2023-02-24', '2023-03-08', '2023-03-09']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-02-10
6  2023-02-24
7  2023-03-08
8  2023-03-09

In [3]:
def create_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    df['Year-Month-Date'] = df['Date'].dt.strftime('%Y-%B-%d')
    return df
create_weekday_column(df)

        Date    Weekday   Year-Month-Date
0 2023-01-01     Sunday   2023-January-01
1 2023-01-02     Monday   2023-January-02
2 2023-01-03    Tuesday   2023-January-03
3 2023-01-04  Wednesday   2023-January-04
4 2023-01-05   Thursday   2023-January-05
5 2023-02-10     Friday  2023-February-10
6 2023-02-24     Friday  2023-February-24
7 2023-03-08  Wednesday     2023-March-08
8 2023-03-09   Thursday     2023-March-09

## Note : For clear understanding of `strftime()` method, i have created an extra column `Year-Month-Date`.

#### In above function `create_weekday_column()` , `to_datetime()` is a method in Pandas that is used to convert a string or a number to a datetime object. It can also be used to convert a list or an array of strings or numbers to a DatetimeIndex.

#### `dt accessor` is used to access the datetime properties of the 'Date' column, and `strftime()` method is used to format the date as a string in the specified format '%A' which gives the full weekday name.  The name strftime stands for "string format time", and it takes a string format code as an argument that specifies the desired format of the output string.

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [10]:
df = pd.DataFrame({'Date':pd.date_range(start='2022-01-01',end='2024-01-31')})
df

          Date
0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
..         ...
756 2024-01-27
757 2024-01-28
758 2024-01-29
759 2024-01-30
760 2024-01-31

[761 rows x 1 columns]

In [11]:
def select_january_month(df):
    start_date = pd.Timestamp('2023-01-01')
    end_date = pd.Timestamp('2023-01-31')
    return df.loc[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

select_january_month(df)

          Date
365 2023-01-01
366 2023-01-02
367 2023-01-03
368 2023-01-04
369 2023-01-05
370 2023-01-06
371 2023-01-07
372 2023-01-08
373 2023-01-09
374 2023-01-10
375 2023-01-11
376 2023-01-12
377 2023-01-13
378 2023-01-14
379 2023-01-15
380 2023-01-16
381 2023-01-17
382 2023-01-18
383 2023-01-19
384 2023-01-20
385 2023-01-21
386 2023-01-22
387 2023-01-23
388 2023-01-24
389 2023-01-25
390 2023-01-26
391 2023-01-27
392 2023-01-28
393 2023-01-29
394 2023-01-30
395 2023-01-31

#### In above function `select_january_month()` , `pd.Timestamp()` function is used to convert the start and end date strings into pandas timestamp objects. Then, the `loc` accessor is used to select all rows where the 'Date' column is between the start and end dates, inclusive.

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself. The pandas library provides various data structures for efficiently storing and manipulating data, such as Series (1-dimensional labeled array) and DataFrame (2-dimensional labeled data structure).

In [ ]:
import pandas as pd

#### By convention, the pandas library is usually imported with the alias pd. This makes it easier to refer to pandas functions and objects throughout your code. Once you've imported pandas, you can start using its functions and data structures in your code.